Sid-shibu/esp32_edge_computing/src/main.cpp
#include <Wire.h> // Hardware I2C library
#include <ESP32Servo.h>
#include <arduinoFFT.h>
#include <WiFi.h>
#include <WebServer.h>
#include <ArduinoJson.h>
#include <SparkFun_I2C_Mux_Arduino_Library.h>
#include <Adafruit_MPU6050.h> // MPU6050 library
#include <Adafruit_Sensor.h> // Dependency for Adafruit_MPU6050
#include <math.h>

#ifndef PI
#define PI 3.14159265359
#endif

// --- HARDWARE CONFIGURATION ---
#define MPU_ADDR 0x68    // Default MPU6050 I2C address (AD0 low)
#define TCA_ADDR 0x70    // Default TCA9548A I2C address
#define EN_BUTTON 0      // GPIO pin for calibration/enable button
#define NUM_SENSORS 3    // Number of MPU6050 sensors connected via multiplexer

// Define servo pins for each sensor (adjust these GPIOs based on your wiring)
const uint8_t SERVO_PIN = 26; // Use a single pin if only one servo is used

// --- TREMOR DETECTION PARAMETERS ---
#define SAMPLES 256
#define SAMPLING_FREQ 250
#define TREMOR_MAGNITUDE_THRESHOLD 50.0
#define TREMOR_CONSISTENCY_THRESHOLD 0.7
#define MIN_TREMOR_DURATION 2000
#define CALIBRATION_SAMPLES 100

// --- TREMOR CLASSIFICATION THRESHOLDS ---
#define REST_TREMOR_MIN 3.0
#define REST_TREMOR_MAX 6.0
#define ACTION_TREMOR_MIN 4.0
#define ACTION_TREMOR_MAX 12.0
#define PATHOLOGICAL_TREMOR_MIN 2.0
#define PATHOLOGICAL_TREMOR_MAX 25.0

// --- FILTERING PARAMETERS ---
#define BUTTERWORTH_CUTOFF 30.0
#define MEDIAN_FILTER_SIZE 5 // Added this global define

// --- OUTPUT PINS ---
#define STATUS_LED 2     // GPIO for status LED
#define BUZZER_PIN 4     // GPIO for buzzer

// === MEDIAN FILTER GLOBALS ===
double medianBuffer[NUM_SENSORS][MEDIAN_FILTER_SIZE] = {0};
int medianIndex[NUM_SENSORS] = {0};

// === SYSTEM STATE FLAGS ===
bool isCalibrated = false;
bool allSensorsOk = true;

// === WIFI CREDENTIALS ===
const char* ssid = "Sky Net";
const char* password = "nizam@kollam";

// === WEB SERVER OBJECT ===
WebServer server(80);

// --- TCA9548A Multiplexer OBJECT ---
QWIICMUX tca; // No argument for constructor

// --- MPU6050 Sensor OBJECT (only one instance needed with multiplexer) ---
Adafruit_MPU6050 mpu; 

// --- SERVO OBJECT (single servo for all strings) ---
Servo servo;

// === STRUCTURES FOR TREMOR ANALYSIS ===
struct TremorData {
  double magnitude;
  double frequency;
  double amplitude;
  double consistency;
  double rmsValue;
  bool isTremor;
  String classification;
  unsigned long duration;
  double confidence;
};

struct SensorReading {
  float accelX, accelY, accelZ; // Changed to float as Adafruit MPU returns float
  float gyroX, gyroY, gyroZ;   // Changed to float
  double magnitude;
  unsigned long timestamp;
};

// === GLOBAL VARIABLES ===
arduinoFFT FFT; // Use correct class name and no template

// FFT Arrays
double* vReal = nullptr;
double* vImag = nullptr;

// Sensor data buffers
SensorReading* sensorBuffer[NUM_SENSORS];
TremorData tremorResults[NUM_SENSORS];
double baselineNoise[NUM_SENSORS] = {0};
unsigned long lastTremorTime[NUM_SENSORS] = {0};
unsigned long tremorStartTime[NUM_SENSORS] = {0};

// --- IMPROVEMENT 1: Butterworth Filter Coefficient Optimization ---
struct ButterworthCoeffs {
  double a0, a1, a2, b1, b2;
  bool initialized = false;
} butterCoeffs[NUM_SENSORS];

double filterHistory[NUM_SENSORS][4] = {0};

void initButterworth(uint8_t sensorIndex, double cutoff, double sampleRate) {
  double omega = 2.0 * PI * cutoff / sampleRate;
  double cosOmega = cos(omega);
  double sinOmega = sin(omega);
  double alpha = sinOmega / sqrt(2.0);
  double norm = 1.0 + alpha;
  butterCoeffs[sensorIndex].a0 = (1.0 - cosOmega) / 2.0 / norm;
  butterCoeffs[sensorIndex].a1 = (1.0 - cosOmega) / norm;
  butterCoeffs[sensorIndex].a2 = (1.0 - cosOmega) / 2.0 / norm;
  butterCoeffs[sensorIndex].b1 = -2.0 * cosOmega / norm;
  butterCoeffs[sensorIndex].b2 = (1.0 - alpha) / norm;
  butterCoeffs[sensorIndex].initialized = true;
}

double butterworthFilter(double input, uint8_t sensorIndex, double cutoff, double sampleRate) {
  if (!butterCoeffs[sensorIndex].initialized) {
    initButterworth(sensorIndex, cutoff, sampleRate);
  }
  double output = butterCoeffs[sensorIndex].a0 * input
                + butterCoeffs[sensorIndex].a1 * filterHistory[sensorIndex][0]
                + butterCoeffs[sensorIndex].a2 * filterHistory[sensorIndex][1]
                - butterCoeffs[sensorIndex].b1 * filterHistory[sensorIndex][2]
                - butterCoeffs[sensorIndex].b2 * filterHistory[sensorIndex][3];
  filterHistory[sensorIndex][1] = filterHistory[sensorIndex][0];
  filterHistory[sensorIndex][0] = input;
  filterHistory[sensorIndex][3] = filterHistory[sensorIndex][2];
  filterHistory[sensorIndex][2] = output;
  return output;
}

// === MEDIAN FILTER FOR SPIKE REMOVAL ===
double applyMedianFilter(double value, uint8_t sensorIndex) {
  medianBuffer[sensorIndex][medianIndex[sensorIndex]] = value;
  medianIndex[sensorIndex] = (medianIndex[sensorIndex] + 1) % MEDIAN_FILTER_SIZE;
  double sorted[MEDIAN_FILTER_SIZE];
  memcpy(sorted, medianBuffer[sensorIndex], sizeof(sorted));
  // --- IMPROVEMENT 2: Use insertion sort for median filter (faster for small arrays) ---
  for (int i = 1; i < MEDIAN_FILTER_SIZE; i++) {
    double key = sorted[i];
    int j = i - 1;
    while (j >= 0 && sorted[j] > key) {
      sorted[j + 1] = sorted[j];
      j--;
    }
    sorted[j + 1] = key;
  }
  return sorted[MEDIAN_FILTER_SIZE / 2];
}

// === MPU6050 INITIALIZATION (using hardware I2C with TCA9548A) ===
bool initMPU(uint8_t sensorChannel) {
  uint8_t muxChannel = sensorChannel + 1; // Shift to channels 1,2,3
  Serial.printf("Sensor %d: Activating TCA channel %d...\n", sensorChannel + 1, muxChannel);
  tca.enablePort(muxChannel); // Use correct SparkFun method

  Serial.printf("Sensor %d: Attempting to initialize MPU on TCA channel %d...\n", sensorChannel + 1, muxChannel);
  
  // The mpu.begin() function will use the currently selected TCA channel
  if (!mpu.begin(MPU_ADDR)) { // Use MPU_ADDR (0x68) or 0x69 if AD0 is high
    Serial.printf("Sensor %d: Failed to find MPU6050 chip on channel %d. Check wiring and address.\n", sensorChannel + 1, muxChannel);
    return false;
  }
  Serial.printf("Sensor %d: MPU6050 Found on channel %d!\n", sensorChannel + 1, muxChannel);

  // Set MPU6050 ranges and filters
  // These settings are applied to the MPU currently active on the TCA channel
  mpu.setAccelerometerRange(MPU6050_RANGE_8_G);
  Serial.printf("Sensor %d: Accel range set to: ", sensorChannel + 1);
  switch (mpu.getAccelerometerRange()) {
    case MPU6050_RANGE_2_G: Serial.println("+-2G"); break;
    case MPU6050_RANGE_4_G: Serial.println("+-4G"); break;
    case MPU6050_RANGE_8_G: Serial.println("+-8G"); break;
    case MPU6050_RANGE_16_G: Serial.println("+-16G"); break;
  }
  mpu.setGyroRange(MPU6050_RANGE_500_DEG);
  Serial.printf("Sensor %d: Gyro range set to: ", sensorChannel + 1);
  switch (mpu.getGyroRange()) {
    case MPU6050_RANGE_250_DEG: Serial.println("+-250 deg/s"); break;
    case MPU6050_RANGE_500_DEG: Serial.println("+-500 deg/s"); break;
    case MPU6050_RANGE_1000_DEG: Serial.println("+-1000 deg/s"); break;
    case MPU6050_RANGE_2000_DEG: Serial.println("+-2000 deg/s"); break;
  }

  mpu.setFilterBandwidth(MPU6050_BAND_21_HZ); // As per PDF suggestion for 5Hz, but 21Hz is a common setting.
                                            // The PDF mentions 5Hz bandwidth, but MPU6050 has discrete options.
                                            // MPU6050_BAND_5_HZ is also an option if stricter filtering desired.
  Serial.printf("Sensor %d: Filter bandwidth set to: ", sensorChannel + 1);
  switch (mpu.getFilterBandwidth()) {
    case MPU6050_BAND_260_HZ: Serial.println("260 Hz"); break;
    case MPU6050_BAND_184_HZ: Serial.println("184 Hz"); break;
    case MPU6050_BAND_94_HZ: Serial.println("94 Hz"); break;
    case MPU6050_BAND_44_HZ: Serial.println("44 Hz"); break;
    case MPU6050_BAND_21_HZ: Serial.println("21 Hz"); break;
    case MPU6050_BAND_10_HZ: Serial.println("10 Hz"); break;
    case MPU6050_BAND_5_HZ: Serial.println("5 Hz"); break;
  }

  delay(100); // Give sensor time to settle after configuration
  Serial.printf("✅ Sensor %d initialized successfully on TCA channel %d.\n", sensorChannel + 1, muxChannel);
  return true;
}

// === READ SENSOR DATA (using hardware I2C with TCA9548A) ===
SensorReading readSensorData(uint8_t sensorChannel) {
  uint8_t muxChannel = sensorChannel + 1; // Shift to channels 1,2,3
  SensorReading reading;
  reading.timestamp = micros();
  tca.enablePort(muxChannel); // Use correct SparkFun method
  
  sensors_event_t a, g, temp;
  // Get new sensor events from the MPU currently active on the TCA channel
  mpu.getEvent(&a, &g, &temp);

