Sid-shibu/esp32_edge_computing/src/main.cpp
  reading.accelX = a.acceleration.x;
  reading.accelY = a.acceleration.y;
  reading.accelZ = a.acceleration.z;
  
  reading.gyroX = g.gyro.x;
  reading.gyroY = g.gyro.y;
  reading.gyroZ = g.gyro.z;
  
  // Calculate magnitude in m/s^2
  // Note: Adafruit library directly gives m/s^2, no need for 16384.0 scaling for raw values.
  // The magnitude calculation is for the vector magnitude of acceleration.
  reading.magnitude = sqrt(pow(reading.accelX, 2) + pow(reading.accelY, 2) + pow(reading.accelZ, 2));
  
  // Check for obviously bad readings (e.g., all zeros or very large numbers if disconnected)
  // A magnitude of 0 usually means a read failure.
  if (reading.magnitude == 0.0f && (reading.accelX == 0.0f && reading.accelY == 0.0f && reading.accelZ == 0.0f)) {
      // This might indicate a communication failure or disconnected sensor
      // Serial.printf("Sensor %d: Read data all zeros. Possible issue.\n", sensorChannel + 1);
      // We already handle this check in detectTremor's warning.
  }
  
  return reading;
}


// === TREMOR DETECTION ALGORITHM ===
// This function needs to process data from a specific sensor, previously handled by software I2C.
// Now it gets data via readSensorData which handles the TCA channel selection.
TremorData detectTremor(uint8_t sensorIndex) {
  TremorData result;
  
  unsigned long sampleInterval = 1000000 / SAMPLING_FREQ;
  
  // Collect samples
  for (int i = 0; i < SAMPLES; i++) {
    unsigned long startTime = micros();
    
    SensorReading reading = readSensorData(sensorIndex); // This now uses hardware I2C via TCA

    // If readSensorData failed (magnitude is 0), warn and continue.
    // The filtering and FFT might get impacted, but we proceed for demonstration.
    if (reading.magnitude == 0 && allSensorsOk) {
      Serial.printf("Warning: Sensor %d returned zero magnitude during sampling. Check connection.\n", sensorIndex + 1);
    }

    double filteredMagnitude = applyMedianFilter(reading.magnitude, sensorIndex);
    double smoothedMagnitude = butterworthFilter(filteredMagnitude, sensorIndex, 
                                                 BUTTERWORTH_CUTOFF, SAMPLING_FREQ);
    
    vReal[i] = smoothedMagnitude; // Store raw smoothed magnitude for DC removal
    vImag[i] = 0.0;
    
    sensorBuffer[sensorIndex][i] = reading; // Store raw readings (optional, for debugging)
    
    // Maintain sampling rate
    while (micros() - startTime < sampleInterval) {
      delayMicroseconds(1);
    }
  }
  
  // Remove DC component (mean subtraction)
  double mean = 0;
  for (int i = 0; i < SAMPLES; i++) mean += vReal[i];
  mean /= SAMPLES;
  for (int i = 0; i < SAMPLES; i++) {
    vReal[i] -= mean;
    // Apply Hann window
    vReal[i] *= 0.5 * (1.0 - cos(2.0 * PI * i / (SAMPLES - 1)));
  }
  // Perform FFT (use correct arduinoFFT API)
  FFT.Windowing(vReal, SAMPLES, FFT_WIN_TYP_HANN, FFT_FORWARD);
  FFT.Compute(vReal, vImag, SAMPLES, FFT_FORWARD);
  FFT.ComplexToMagnitude(vReal, vImag, SAMPLES);
  
  // Find dominant frequency
  double maxMagnitude = 0;
  int peakIndex = 0;
  double freqResolution = (double)SAMPLING_FREQ / SAMPLES;
  
  // Search within the pathological tremor frequency range
  int minBin = max(1, (int)(PATHOLOGICAL_TREMOR_MIN / freqResolution)); // Avoid DC component (bin 0)
  int maxBin = min(SAMPLES/2, (int)(PATHOLOGICAL_TREMOR_MAX / freqResolution)); // Max bin is N/2 (Nyquist)
  
  for (int i = minBin; i < maxBin; i++) {
    if (vReal[i] > maxMagnitude) {
      maxMagnitude = vReal[i];
      peakIndex = i;
    }
  }
  
  result.frequency = peakIndex * freqResolution;
  result.amplitude = maxMagnitude; // Amplitude of the dominant frequency component
  
  // Calculate RMS of the AC component (tremor signal)
  double rmsSumSq = 0;
  for (int i = 0; i < SAMPLES; i++) {
    rmsSumSq += vReal[i] * vReal[i]; // vReal here contains the windowed, DC-removed signal
  }
  result.rmsValue = sqrt(rmsSumSq / SAMPLES);
  
  // Calculate total magnitude (average absolute value of the AC component)
  result.magnitude = 0;
  for (int i = 0; i < SAMPLES; i++) {
    result.magnitude += abs(vReal[i]);
  }
  result.magnitude /= SAMPLES;
  
  // Calculate consistency (fundamental vs harmonics)
  double fundamentalMag = vReal[peakIndex];
  double harmonicMag = 0;
  if (peakIndex * 2 < SAMPLES/2) harmonicMag += vReal[peakIndex * 2];
  if (peakIndex * 3 < SAMPLES/2) harmonicMag += vReal[peakIndex * 3];
  
  result.consistency = (fundamentalMag + 1e-6) / (fundamentalMag + harmonicMag + 1e-6); // Avoid division by zero
  
  // Tremor detection criteria
  bool magnitudeCheck = result.rmsValue > TREMOR_MAGNITUDE_THRESHOLD;
  bool frequencyCheck = result.frequency >= PATHOLOGICAL_TREMOR_MIN && 
                        result.frequency <= PATHOLOGICAL_TREMOR_MAX;
  bool consistencyCheck = result.consistency > TREMOR_CONSISTENCY_THRESHOLD;
  
  // Amplitude check against baseline noise (noise floor of the FFT)
  bool amplitudeCheck = result.amplitude > baselineNoise[sensorIndex] * 3.0; // 3x noise floor
  
  result.isTremor = magnitudeCheck && frequencyCheck && consistencyCheck && amplitudeCheck;
  
  // Calculate confidence based on how many criteria are met
  result.confidence = 0.0;
  if (magnitudeCheck) result.confidence += 0.25;
  if (frequencyCheck) result.confidence += 0.25;
  if (consistencyCheck) result.confidence += 0.25;
  if (amplitudeCheck) result.confidence += 0.25;
  
  // Classify tremor type
  if (result.isTremor) {
    if (result.frequency >= REST_TREMOR_MIN && result.frequency <= REST_TREMOR_MAX) {
      result.classification = "Rest Tremor";
    } else if (result.frequency >= ACTION_TREMOR_MIN && result.frequency <= ACTION_TREMOR_MAX) {
      result.classification = "Action Tremor";
    } else if (result.frequency > ACTION_TREMOR_MAX) { // Beyond action tremor range, but still within pathological
      result.classification = "High-Frequency Tremor";
    } else { // Below action tremor range, but still within pathological
      result.classification = "Low-Frequency Tremor";
    }
    
    if (tremorStartTime[sensorIndex] == 0) {
      tremorStartTime[sensorIndex] = millis();
    }
    result.duration = millis() - tremorStartTime[sensorIndex];
    lastTremorTime[sensorIndex] = millis();
  } else {
    result.classification = "Normal";
    // Reset tremor duration if no tremor for a certain period
    if (millis() - lastTremorTime[sensorIndex] > MIN_TREMOR_DURATION) {
      tremorStartTime[sensorIndex] = 0;
      result.duration = 0;
    }
  }
  
  return result;
}

// --- SERVO DEBUG FUNCTION ---
#define SERVO_DEBUG
int lastServoAngle = 90; // Store last angle
unsigned long lastServoUpdate = 0; // For non-blocking update
const unsigned long SERVO_UPDATE_INTERVAL = 20; // ms
void debugServoWrite(int angle) {
#ifdef SERVO_DEBUG
  Serial.printf("[SERVO] Writing angle: %d\n", angle);
#endif
  lastServoAngle = angle;
}

void updateServoIfNeeded() {
  unsigned long now = millis();
  if (now - lastServoUpdate >= SERVO_UPDATE_INTERVAL) {
    servo.write(lastServoAngle);
    lastServoUpdate = now;
  }
}

// === SERVO CONTROL WITH TREMOR COMPENSATION ===
void controlTremorFeedback(uint8_t sensorIndex, TremorData tremor) {
  // Only activate compensation if tremor is detected with high confidence
  if (!tremor.isTremor || tremor.confidence < 0.5) {
    debugServoWrite(90); // Neutral position
    return;
  }
  
  // Map tremor magnitude to an intensity (0-100)
  double intensity = map(tremor.rmsValue, 0, TREMOR_MAGNITUDE_THRESHOLD * 2, 0, 100); // Scale based on RMS
  intensity = constrain(intensity, 0, 100);
  
  int baseAngle = 90;
  // Amplitude of servo movement based on intensity
  int amplitude = map(intensity, 0, 100, 0, 45); // Max 45 degrees swing (90 +/- 45 = 45 to 135)
  
  // Calculate phase for a continuous sinusoidal motion based on tremor frequency
  // millis() gives milliseconds, tremor.frequency is Hz.
  // (millis() / 1000.0) converts millis to seconds
  double phase = (millis() / 1000.0) * tremor.frequency * 2 * PI;
  
