Sid-shibu/esp32_edge_computing/src/main.cpp
  // Apply a 180° phase shift (PI radians) for counter-phase compensation
  int angle = baseAngle + amplitude * sin(phase + PI); 
  
  angle = constrain(angle, 45, 135); // Ensure angle stays within safe limits for typical servos
  debugServoWrite(angle);
}

// === SERVO CONTROL WITH TREMOR COMPENSATION (SINGLE SERVO) ===
void controlTensionServo() {
  // Find the maximum tremor RMS value and confidence among all sensors
  double maxRMS = 0;
  double maxConfidence = 0;
  double maxFrequency = 0;
  bool tremorDetected = false;
  for (int i = 0; i < NUM_SENSORS; i++) {
    if (tremorResults[i].isTremor && tremorResults[i].confidence > maxConfidence) {
      maxConfidence = tremorResults[i].confidence;
      maxRMS = tremorResults[i].rmsValue;
      maxFrequency = tremorResults[i].frequency;
      tremorDetected = true;
    }
  }
  if (!tremorDetected || maxConfidence < 0.5) {
    debugServoWrite(90); // Neutral position
    return;
  }
  // Map tremor RMS to intensity (0-100)
  double intensity = map(maxRMS, 0, TREMOR_MAGNITUDE_THRESHOLD * 2, 0, 100);
  intensity = constrain(intensity, 0, 100);
  int baseAngle = 90;
  int amplitude = map(intensity, 0, 100, 0, 45); // Max 45 degrees swing
  double phase = (millis() / 1000.0) * maxFrequency * 2 * PI;
  int angle = baseAngle + amplitude * sin(phase + PI);
  angle = constrain(angle, 45, 135);
  debugServoWrite(angle);
}

// === CALIBRATION PROCEDURE ===
void calibrateBaseline() {
  Serial.println("🔧 Starting baseline calibration...");
  digitalWrite(STATUS_LED, HIGH);
  
  // Re-initialize allSensorsOk to true before starting calibration for a clean check
  allSensorsOk = true; 

  for (int sensor = 0; sensor < NUM_SENSORS; sensor++) {
    Serial.printf("Calibrating sensor %d...\n", sensor + 1);
    
    double totalMagnitude = 0;
    int validReadings = 0;
    
    for (int i = 0; i < CALIBRATION_SAMPLES; i++) {
      SensorReading reading = readSensorData(sensor); // This reads from the specific sensor via TCA
      // Only count readings if magnitude is not zero (indicating a successful read)
      if (reading.magnitude > 0) {  
        // Apply median and Butterworth filter during calibration to get a clean baseline
        double filteredMagnitude = applyMedianFilter(reading.magnitude, sensor);
        double smoothedMagnitude = butterworthFilter(filteredMagnitude, sensor, 
                                                     BUTTERWORTH_CUTOFF, SAMPLING_FREQ);
        totalMagnitude += smoothedMagnitude;
        validReadings++;
      }
      delay(10); // Small delay between calibration samples
    }
    
    if (validReadings > 0) {
      baselineNoise[sensor] = totalMagnitude / validReadings;
      Serial.printf("Sensor %d baseline: %.2f (from %d readings)\n", 
                    sensor + 1, baselineNoise[sensor], validReadings);
    } else {
      Serial.printf("❌ Sensor %d: No valid readings during calibration! Setting default baseline.\n", sensor + 1);
      baselineNoise[sensor] = 10.0; // Default value if no valid readings obtained
      allSensorsOk = false; // Mark system as not fully okay if a sensor fails calibration
    }
  }
  
  isCalibrated = true;
  digitalWrite(STATUS_LED, LOW);
  Serial.println("✅ Calibration complete!");
  
  // Beep confirmation
  for (int i = 0; i < 3; i++) {
    digitalWrite(BUZZER_PIN, HIGH);
    delay(100);
    digitalWrite(BUZZER_PIN, LOW);
    delay(100);
  }
}

// --- IMPROVEMENT 3: Increase JSON buffer size for future expansion ---
void sendTremorDataJSON() {
  StaticJsonDocument<2048> doc;
  doc["timestamp"] = millis();
  doc["calibrated"] = isCalibrated;
  doc["all_sensors_ok"] = allSensorsOk;
  JsonArray sensors = doc.createNestedArray("sensors");
  for (int i = 0; i < NUM_SENSORS; i++) {
    JsonObject sensor = sensors.createNestedObject();
    sensor["id"] = i + 1;
    sensor["tremor_detected"] = tremorResults[i].isTremor;
    sensor["frequency"] = round(tremorResults[i].frequency * 100) / 100.0;
    sensor["amplitude"] = round(tremorResults[i].amplitude * 100) / 100.0;
    sensor["magnitude"] = round(tremorResults[i].magnitude * 100) / 100.0;
    sensor["rms"] = round(tremorResults[i].rmsValue * 100) / 100.0;
    sensor["consistency"] = round(tremorResults[i].consistency * 1000) / 1000.0;
    sensor["confidence"] = round(tremorResults[i].confidence * 1000) / 1000.0;
    sensor["classification"] = tremorResults[i].classification;
    sensor["duration"] = tremorResults[i].duration;
    sensor["baseline"] = round(baselineNoise[i] * 100) / 100.0;
  }
  bool overallTremor = false;
  double avgFrequency = 0;
  int tremorCount = 0;
  for (int i = 0; i < NUM_SENSORS; i++) {
    if (tremorResults[i].isTremor && tremorResults[i].confidence > 0.6) {
      overallTremor = true;
      avgFrequency += tremorResults[i].frequency;
      tremorCount++;
    }
  }
  if (tremorCount > 0) avgFrequency /= tremorCount;
  doc["overall_tremor"] = overallTremor;
  doc["average_frequency"] = round(avgFrequency * 100) / 100.0;
  doc["tremor_severity"] = "None";
  if (tremorCount > 2) doc["tremor_severity"] = "High";
  else if (tremorCount > 1) doc["tremor_severity"] = "Medium";
  else if (tremorCount > 0) doc["tremor_severity"] = "Low";
  String output;
  serializeJson(doc, output);
  Serial.println(output);
}

// --- IMPROVEMENT 4: Add /status endpoint for health checks ---
void handleStatus() {
  StaticJsonDocument<256> doc;
  doc["status"] = "ok";
  doc["calibrated"] = isCalibrated;
  doc["all_sensors_ok"] = allSensorsOk;
  doc["wifi"] = (WiFi.status() == WL_CONNECTED);
  String output;
  serializeJson(doc, output);
  server.send(200, "application/json", output);
}

// === WEB SERVER HANDLERS ===
void handleRoot() {
  String html = R"rawliteral(
    <!DOCTYPE html>
    <html><head><title>Tremor Monitor</title>
    <meta name='viewport' content='width=device-width, initial-scale=1'>
    <style>
      body {font-family:Arial, sans-serif;margin:20px;background:#f0f0f0;color:#333;}
      h1 {color:#0056b3;}
      .card {
        background:white;
        padding:20px;
        margin-bottom:15px; 
        border-radius:10px;
        box-shadow:0 2px 10px rgba(0,0,0,0.1);
        transition: all 0.3s ease-in-out; 
      }
      .card h3 {margin-top:0; color:#0056b3;}
      .tremor {background:#ffebee;border-left:5px solid #f44336;}
      .normal {background:#e8f5e8;border-left:5px solid #4caf50;}
      .error {background:#fff3e0;border-left:5px solid #ff9800;}
      .button {
        display: inline-block;
        background-color: #007bff;
        color: white;
        padding: 10px 20px;
        border: none;
        border-radius: 5px;
        text-decoration: none;
        margin-top: 10px;
        cursor: pointer;
      }
      .button:hover {background-color: #0056b3;}
    </style>
    </head><body>
    <h1>Tremor Detection Monitor</h1>
    <div id='data'></div>
    <div class="card">
      <h3>Actions</h3>
      <button class="button" onclick="location.reload()">Refresh Data</button>
      <p>Press the EN button on the ESP32 to re-calibrate.</p>
    </div>

    <script>
    setInterval(()=>{
      fetch('/data').then(r=>r.json()).then(d=>{
        let html = '<div class="card"><h3>System Status</h3>';
        html += '<p>Calibrated: ' + (d.calibrated ? 'OK Yes' : 'ERROR No') + '</p>'; // Replaced ✅ with OK, ❌ with ERROR
        html += '<p>All Sensors OK: ' + (d.all_sensors_ok ? 'OK Yes' : 'ERROR No - Check Connections!') + '</p>'; // Replaced ✅ with OK, ❌ with ERROR
        html += '<p>Overall Tremor: ' + (d.overall_tremor ? 'Warning DETECTED' : 'Normal') + '</p>'; // Replaced ⚠ with Warning, ✅ with nothing
        html += '<p>Severity: <strong>' + d.tremor_severity + '</strong></p>';
        if (d.overall_tremor) {
          html += '<p>Average Freq: ' + d.average_frequency + ' Hz</p>';
        }
        html += '</div>';
        
        d.sensors.forEach(s=>{
          let statusClass = 'normal';
          if (s.baseline === 0 || !d.all_sensors_ok) statusClass = 'error'; // Error if baseline is 0 or overall sensors are not ok
          else if (s.tremor_detected) statusClass = 'tremor';
          
