Sid-shibu/esp32_edge_computing/src/main.cpp
          html += '<div class="card ' + statusClass + '">';
          html += '<h3>Finger ' + s.id + ' Sensor</h3>';
          
          if (s.baseline === 0 || !d.all_sensors_ok) { 
            html += '<p>Warning: Sensor Error or Uncalibrated - Check Connection/Calibration</p>'; // Replaced ⚠
          } else {
            html += '<p>Status: <strong>' + (s.tremor_detected ? 'Warning: Tremor Detected' : 'Normal') + '</strong></p>'; // Replaced ⚠ and ✅
            html += '<p>Classification: ' + s.classification + '</p>';
            html += '<p>Frequency: ' + s.frequency + ' Hz</p>';
            html += '<p>RMS Magnitude: ' + s.rms + '</p>';
            html += '<p>Amplitude (FFT Peak): ' + s.amplitude + '</p>';
            html += '<p>Consistency: ' + (s.consistency*100).toFixed(1) + '%</p>';
            html += '<p>Confidence: ' + (s.confidence*100).toFixed(1) + '%</p>';
            html += '<p>Duration: ' + (s.duration / 1000).toFixed(1) + ' s</p>';
            html += '<p>Baseline Noise: ' + s.baseline + '</p>';
          }
          html += '</div>';
        });
        document.getElementById('data').innerHTML = html;
      }).catch(e=>{
        console.error("Error fetching data:", e);
        document.getElementById('data').innerHTML = '<div class="card error"><h3>Connection Error</h3><p>Unable to fetch data from ESP32. Ensure WiFi is connected and ESP32 is running.</p></div>';
      });
    }, 1000); // Update every 1 second
    </script></body></html>
  )rawliteral";
  server.send(200, "text/html", html);
}

void handleData() {
  StaticJsonDocument<1024> doc; 
  doc["timestamp"] = millis();
  doc["calibrated"] = isCalibrated;
  doc["all_sensors_ok"] = allSensorsOk;
  
  JsonArray sensors = doc.createNestedArray("sensors");
  for (int i = 0; i < NUM_SENSORS; i++) {
    JsonObject sensor = sensors.createNestedObject();
    sensor["id"] = i + 1;
    sensor["tremor_detected"] = tremorResults[i].isTremor;
    sensor["frequency"] = tremorResults[i].frequency;
    sensor["amplitude"] = tremorResults[i].amplitude;
    sensor["magnitude"] = tremorResults[i].magnitude;
    sensor["rms"] = tremorResults[i].rmsValue;
    sensor["consistency"] = tremorResults[i].consistency;
    sensor["confidence"] = tremorResults[i].confidence;
    sensor["classification"] = tremorResults[i].classification;
    sensor["duration"] = tremorResults[i].duration;
    sensor["baseline"] = baselineNoise[i];
  }
  
  // Overall tremor analysis
  bool overallTremor = false;
  double avgFrequency = 0;
  int tremorCount = 0;
  
  for (int i = 0; i < NUM_SENSORS; i++) {
    if (tremorResults[i].isTremor && tremorResults[i].confidence > 0.6) {
      overallTremor = true;
      avgFrequency += tremorResults[i].frequency;
      tremorCount++;
    }
  }
  
  if (tremorCount > 0) avgFrequency /= tremorCount;
  
  doc["overall_tremor"] = overallTremor;
  doc["average_frequency"] = avgFrequency;
  doc["tremor_severity"] = "None";
  if (tremorCount > 2) doc["tremor_severity"] = "High";
  else if (tremorCount > 1) doc["tremor_severity"] = "Medium";
  else if (tremorCount > 0) doc["tremor_severity"] = "Low";
  
  String output;
  serializeJson(doc, output);
  server.send(200, "application/json", output);
}

void setup() {
  Serial.begin(115200);
  Serial.println("🚀 Starting ESP32 Tremor Detection System");

  // === (Optional) QUICK SERVO TEST ===
  // Uncomment the following block if you want to test the servo at startup
  /*
  Serial.println("[SERVO TEST] Attaching servo to pin 26 and sweeping 0-180...");
  servo.attach(SERVO_PIN);
  for (int angle = 0; angle <= 180; angle += 30) {
    Serial.printf("[SERVO TEST] Writing angle: %d\n", angle);
    servo.write(angle);
    delay(500);
  }
  for (int angle = 180; angle >= 0; angle -= 30) {
    Serial.printf("[SERVO TEST] Writing angle: %d\n", angle);
    servo.write(angle);
    delay(500);
  }
  Serial.println("[SERVO TEST] Sweep complete. If servo did not move, check wiring and power.");
  delay(1000);
  */

  // Attach the single servo to the defined pin (only once!)
  servo.attach(SERVO_PIN);
  debugServoWrite(90); // Center position for servo
  updateServoIfNeeded();
  delay(2);
  debugServoWrite(0); // Move to 0 degrees
  updateServoIfNeeded();
  delay(2);
  debugServoWrite(180); // Move to 180 degrees
  updateServoIfNeeded();
  delay(2);
  debugServoWrite(90); // Back to center
  updateServoIfNeeded();
  delay(2);
  
  // Allocate memory for FFT arrays
  vReal = (double*)malloc(SAMPLES * sizeof(double));
  vImag = (double*)malloc(SAMPLES * sizeof(double));
  
  // Check memory allocation for FFT arrays
  if (!vReal || !vImag) {
    Serial.println("❌ Failed to allocate FFT memory! Halting.");
    while(true); // Halt the program
  }
  
  // Allocate memory for sensor buffers
  for (int i = 0; i < NUM_SENSORS; i++) {
    sensorBuffer[i] = (SensorReading*)malloc(SAMPLES * sizeof(SensorReading));
    if (!sensorBuffer[i]) {
      Serial.printf("❌ Failed to allocate sensor buffer memory for sensor %d! Halting.\n", i + 1);
      while(true); // Halt the program
    }
  }
  
  // Setup pins
  pinMode(EN_BUTTON, INPUT_PULLUP);
  pinMode(STATUS_LED, OUTPUT);
  pinMode(BUZZER_PIN, OUTPUT);
  
  // Setup ESP32 servo timers
  ESP32PWM::allocateTimer(0);
  ESP32PWM::allocateTimer(1);
  ESP32PWM::allocateTimer(2);
  ESP32PWM::allocateTimer(3);
  
  // --- Initialize Hardware I2C and TCA9548A ---
  Wire.begin(); // Initialize default hardware I2C pins (GPIO 21 SDA, GPIO 22 SCL)
  Serial.println("Hardware I2C (Wire) initialized.");

  if (!tca.begin()) {
    Serial.println("❌ Failed to find TCA9548A multiplexer! Check wiring.");
    while(true); // Halt if multiplexer not found
  }
  Serial.println("TCA9548A Multiplexer found and initialized.");
  
  // --- Initialize MPU6050 sensors via TCA9548A ---
  Serial.println("🔧 Initializing MPU6050 sensors through TCA9548A...");
  for (int i = 0; i < NUM_SENSORS; i++) {
    if (!initMPU(i)) { // Pass the channel index (0 to NUM_SENSORS-1)
      Serial.printf("❌ Failed to initialize MPU6050 on TCA channel %d! This sensor might be problematic.\n", i);
      allSensorsOk = false; // Set overall status to false if any sensor fails
    } else {
      Serial.printf("✅ MPU6050 on TCA channel %d initialized successfully.\n", i);
    }
  }
  // Attach the single servo to the defined pin
  servo.attach(SERVO_PIN);
  debugServoWrite(90); // Center position for servo
  updateServoIfNeeded();
  delay(500);
  debugServoWrite(0); // Move to 0 degrees
  updateServoIfNeeded();
  delay(1000);
  debugServoWrite(180); // Move to 180 degrees
  updateServoIfNeeded();
  delay(1000);
  debugServoWrite(90); // Back to center
  updateServoIfNeeded();
  delay(1000);
  
