Sid-shibu/esp32_edge_computing/src/main.cpp
  // Start WiFi connection
  Serial.println("Connecting to WiFi...");
  WiFi.begin(ssid, password);
  int wifi_attempts = 0;
  while (WiFi.status() != WL_CONNECTED && wifi_attempts < 20) { 
    delay(500);
    Serial.print(".");
    wifi_attempts++;
  }
  if (WiFi.status() == WL_CONNECTED) {
    Serial.println("\nWiFi connected: " + WiFi.localIP().toString());
  } else {
    Serial.println("\n❌ Failed to connect to WiFi!");
  }
  
  // Start web server
  server.on("/", handleRoot);
  server.on("/data", handleData);
  server.on("/status", handleStatus); // New endpoint
  server.begin();
  Serial.println("Web server started.");
  
  // Wait for calibration (or force if button not pressed)
  Serial.println("Press the EN button to calibrate (or wait 5 seconds for auto-calibration if button not pressed)...");    
}

void loop() {
  // Check if EN button is pressed for calibration
  if (digitalRead(EN_BUTTON) == LOW) {
    delay(50); // Debounce delay
    if (digitalRead(EN_BUTTON) == LOW) { // Check again after debounce
      calibrateBaseline();
    }
  }
  // --- MAIN TREMOR DETECTION AND FEEDBACK LOOP ---
  for (int i = 0; i < NUM_SENSORS; i++) {
    tremorResults[i] = detectTremor(i);
    Serial.printf("Sensor %d - Tremor: %s, Freq: %.2f Hz, RMS: %.2f, Amp: %.2f, Consistency: %.2f, Confidence: %.2f\n", 
      i + 1, 
      tremorResults[i].isTremor ? "Yes" : "No", 
      tremorResults[i].frequency, 
      tremorResults[i].rmsValue, 
      tremorResults[i].amplitude, 
      tremorResults[i].consistency, 
      tremorResults[i].confidence);
  }
  controlTensionServo();
  updateServoIfNeeded(); // Non-blocking servo update
  sendTremorDataJSON();
  delay(10); // Reduce delay for more responsive servo
}